In [2]:
import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings("ignore")

In [20]:
df=pd.read_table("chiporders.tsv")
#df.head(7)
#df.tail()
df.sample(5)

,order_id,quantity,item_name,choice_description,item_price
3153,1258,1,Steak Burrito,"[[Roasted Chili Corn Salsa (Medium), Tomatillo...",$8.99
3623,1450,1,Chicken Salad Bowl,"[Roasted Chili Corn Salsa, [Rice, Pinto Beans,...",$8.75
3129,1248,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Pinto Beans, Chees...",$9.25
2234,900,1,Steak Bowl,"[[Fresh Tomato Salsa (Mild), Tomatillo-Green C...",$8.99
3313,1328,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Cheese, Sour Cream...",$11.75

In [26]:
df=pd.read_table("fifa_data.csv",sep=",")
df.head(1)

,Unnamed: 0,ID,Name,Age,Photo,Nationality,Flag,Overall,Potential,Club,...,Composure,Marking,StandingTackle,SlidingTackle,GKDiving,GKHandling,GKKicking,GKPositioning,GKReflexes,Release Clause
0,0,158023,L. Messi,31,https://cdn.sofifa.org/players/4/19/158023.png,Argentina,https://cdn.sofifa.org/flags/52.png,94,94,FC Barcelona,...,96.0,33.0,28.0,26.0,6.0,11.0,15.0,14.0,8.0,€226.5M

In [32]:
df=pd.read_csv("fifa_data.csv")
df.head(1)

,Unnamed: 0,ID,Name,Age,Photo,Nationality,Flag,Overall,Potential,Club,...,Composure,Marking,StandingTackle,SlidingTackle,GKDiving,GKHandling,GKKicking,GKPositioning,GKReflexes,Release Clause
0,0,158023,L. Messi,31,https://cdn.sofifa.org/players/4/19/158023.png,Argentina,https://cdn.sofifa.org/flags/52.png,94,94,FC Barcelona,...,96.0,33.0,28.0,26.0,6.0,11.0,15.0,14.0,8.0,€226.5M

In [56]:
c=["id","Age","Gender","Designation","Salary"]
df=pd.read_table("psd.user",sep="|",header=None,names=c)
df.head(10)

   id  Age Gender    Designation Salary
0   1   24      M     technician  85711
1   2   53      F          other  94043
2   3   23      M         writer  32067
3   4   24      M     technician  43537
4   5   33      F          other  15213
5   6   42      M      executive  98101
6   7   57      M  administrator  91344
7   8   36      M  administrator  05201
8   9   29      M        student  01002
9  10   53      M         lawyer  90703

In [60]:
df=pd.read_json("simple.json")
df.head(1)

    name  age grade
0  Andew   12     A

In [66]:
df=pd.read_json("simple_records.json",lines=True)
df.head(2)

     name  age grade
0   Andew   12     A
1  Bhuvan   18     B

In [68]:
a={"April","ab"}
b={"May","cd"}
c={"June","ef"}
d=[{"April","ab"},
{"May","cd"},
{"June","ef"}]

In [70]:
a

{'April', 'ab'}

In [72]:
b

{'May', 'cd'}

In [74]:
c

{'June', 'ef'}

In [76]:
d

[{'April', 'ab'}, {'May', 'cd'}, {'June', 'ef'}]

In [78]:
type(d)

list

In [80]:
df=pd.read_csv("movies.csv")
df.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [82]:
df.info()
#  2   content_rating  976 non-null    object 
# 976 non null rows means 3 null rows

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 979 entries, 0 to 978
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   star_rating     979 non-null    float64
 1   title           979 non-null    object
 2   content_rating  976 non-null    object
 3   genre           979 non-null    object
 4   duration        979 non-null    int64
 5   actors_list     979 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 46.0+ KB

In [86]:
df.isnull().sum() #

star_rating       0
title             0
content_rating    3
genre             0
duration          0
actors_list       0
dtype: int64

In [88]:
df.star_rating

0      9.3
1      9.2
2      9.1
3      9.0
4      8.9
      ...
974    7.4
975    7.4
976    7.4
977    7.4
978    7.4
Name: star_rating, Length: 979, dtype: float64

In [90]:
df["star_rating"] # preferable

0      9.3
1      9.2
2      9.1
3      9.0
4      8.9
      ...
974    7.4
975    7.4
976    7.4
977    7.4
978    7.4
Name: star_rating, Length: 979, dtype: float64

In [96]:
df[["star_rating","content_rating","title"]]

,star_rating,content_rating,title
0,9.3,R,The Shawshank Redemption
1,9.2,R,The Godfather
2,9.1,R,The Godfather: Part II
3,9.0,PG-13,The Dark Knight
4,8.9,R,Pulp Fiction
...,...,...,...
974,7.4,PG,Tootsie
975,7.4,PG,Back to the Future Part III
976,7.4,PG-13,Master and Commander: The Far Side of the World
977,7.4,PG,Poltergeist
978,7.4,R,Wall Street

In [98]:
df["star_rating"].max()

9.3

In [100]:
df["star_rating"].min()

7.4

In [104]:
df["star_rating"].mean()

7.889785495403474

In [106]:
df.describe()

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000